#h = int(input("часы:"))
#m = int(input("минуты:"))
#s = int(input("секунды:"))
#
#if  23 >= h >= 0 and 59 >= m >= 0 and 59 >= s >= 0:
#    print("правильный формат")
#    print(f"{h}:{m}:{s} ")
#else:
#    print("ошибка")
#    if h > 23 or h < 0:
#        print("часы в формате [0, 23]")
#     elif m > 59 or m < 0:
#         print("минуты в формате [0, 59]")
#     if s > 59 or s < 0:
#         print("секунды в формате [0, 59]")
#
# )
#     print("твой счет:", count)
#     quit()count = 0
#
# q1 = input("какого цвета трава?\n"
#            "a)голубая, б)коричневая, в)60 бойцов, г)зеленая\n"
#            "--> ")
# if q1 == "г":
#     count = count + 1
#     print("правильно")
# else:
#     print("одна ошибка - и ты ошибка")
#     print("твой счет:", count)
#     quit()
# q2 = "сколько ног у паука\n"
#      "a)8, б)1, в)90, г)67865\n"
#            "--> ")
# if q2 == "a":
#     count = count + 1
#     print("правильно")
# else:
#     print("одна ошибка - и ты ошибка"
# q3 ="тунель какой длины может прорыть крот за одну ночь\n"
#     "a)87, б)7, в)76, г)0\n"
#            "--> ")
# if q3 == "в":
#     count = count + 1
#     print("правильно")
# else:
#     print("одна ошибка - и ты ошибка")
#     print("твой счет:", count)
#     quit()

